Revit 2025 API
PointCloudColorMode Enumeration
 Color mode of a point cloud or part of a point cloud
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum PointCloudColorMode
Public Enumeration PointCloudColorMode
public enum class PointCloudColorMode
type PointCloudColorMode
Members
Member name | Value | Description
NoOverride | 0 |  Show the actual colors
FixedColor | 1 |  Show a single color
Elevation | 2 |  Color by elevation
Intensity | 3 |  Color by intensity (reflectivity)
Normals | 4 |  Color by normal vectors
See Also
Reference
Autodesk.Revit.DB Namespace